[
    {
        "id": 1,
        "tab": "Procedural",
        "content": "A procedural language follows a sequence of statements or commands in order to achieve a desired output. Each series of steps is called a procedure, and a program written in one of these languages will have one or more procedures within it. Common examples of procedural languages include:<ul><li>C and C++</li><li>Java</li><li>Pascal</li><li>BASIC</li></ul>"
    },
    {
        "id": 2,
        "tab": "Functional",
        "content": "Rather than focusing on the execution of statements, functional languages focus on the output of mathematical functions and evaluations. Each function–a reusable module of code–performs a specific task and returns a result. The result will vary depending on what data you input into the function. Some popular functional programming languages include:<ul><li>Scala</li><li>Erlang</li><li>Haskell</li><li>Elixir</li><li>F#</li></ul>"
    },
    {
        "id": 3,
        "tab": "Object-oriented",
        "content": "This type of language treats a program as a group of objects composed of data and program elements, known as attributes and methods. Objects can be reused within a program or in other programs. This makes it a popular language type for complex programs, as code is easier to reuse and scale. Some common object-oriented languages include:<ul><li>Java</li><li>Python</li><li>PHP</li><li>C++</li><li>Ruby</li></ul>"
    },
    {
        "id": 4,
        "tab": "Scripting",
        "content": "Programmers use scripting languages to automate repetitive tasks, manage dynamic web content, or support processes in larger applications. Some common scripting languages include:<ul><li>PHP</li><li>Ruby</li><li>Python</li><li>bash</li><li>Perl</li><li>Node.js</li></ul>"
    },
    {
        "id": 5,
        "tab": "Logic",
        "content": "Instead of telling a computer what to do, a logic programming language expresses a series of facts and rules to instruct the computer on how to make decisions. Some examples of logic languages include:<ul><li>Prolog</li><li>Absys</li><li>Datalog</li><li>Alma-0</li></ul>"
    }
]
